In [ ]:
Question 4 -
Write a program to download the data from the link given below and then read the data and convert the into
the proper structure and return it as a CSV file.
Link - https://data.nasa.gov/resource/y77d-th95.json
Note - Write code comments wherever needed for code understanding.

In [ ]:
Excepted Output Data Attributes
● Name of Earth Meteorite - string id - ID of Earth
● Meteorite - int nametype - string recclass - string
● mass - Mass of Earth Meteorite - float year - Year at which Earth
● Meteorite was hit - datetime format reclat - float recclong - float
● point coordinates - list of int

In [1]:
#Start

In [35]:
#Imports
import pandas as pd
import numpy as np
import json
import requests

In [36]:
url = "https://data.nasa.gov/resource/y77d-th95.json"

In [39]:
file01 = requests.get(url)
open("data/nasa.json", "wb").write(file01.content)

245975

In [42]:
with open ("data/nasa.json","r") as f:
    data = json.loads(f.read())

In [44]:
df =pd.json_normalize(data)

In [46]:
df.head()

,name,id,nametype,recclass,mass,fall,year,reclat,reclong,geolocation.type,geolocation.coordinates,:@computed_region_cbhk_fwbd,:@computed_region_nnqa_25f4
0,Aachen,1,Valid,L5,21,Fell,1880-01-01T00:00:00.000,50.775000,6.083330,Point,"[6.08333, 50.775]",NaN,NaN
1,Aarhus,2,Valid,H6,720,Fell,1951-01-01T00:00:00.000,56.183330,10.233330,Point,"[10.23333, 56.18333]",NaN,NaN
2,Abee,6,Valid,EH4,107000,Fell,1952-01-01T00:00:00.000,54.216670,-113.000000,Point,"[-113, 54.21667]",NaN,NaN
3,Acapulco,10,Valid,Acapulcoite,1914,Fell,1976-01-01T00:00:00.000,16.883330,-99.900000,Point,"[-99.9, 16.88333]",NaN,NaN
4,Achiras,370,Valid,L6,780,Fell,1902-01-01T00:00:00.000,-33.166670,-64.950000,Point,"[-64.95, -33.16667]",NaN,NaN

In [ ]:
import pandas as pd

# create a sample DataFrame
df = pd.DataFrame({'time': ['34:22', '12:45', '56:34']})

# split the time column into minutes and seconds
df[['min', 'sec']] = df['time'].str.split(':', expand=True)

# convert the minutes and seconds columns to integers
df[['min', 'sec']] = df[['min', 'sec']].astype(int)

# create a datetime column with hours, minutes, and seconds
df['datetime'] = pd.to_datetime({
    'hour': 0,
    'minute': df['min'],
    'second': df['sec']
})

# display the resulting DataFrame with datetime objects
print(df)